[
    "People spend night on roofs and in trees after Ukraine dam breach",
    "People spend night on roofs and in trees after Ukraine dam breach",
    "ByteDance accused of helping China spy on HK activists",
    "Why is Japan redefining rape?",
    "Liang and Li handed lifetime bans for match-fixing",
    "Why it took 42 years to convict a 90-year-old in India",
    "Watch moment thief gives up on liquor store robbery",
    "Japan rethinks tattoo ban in defence forces",
    "Orange wildfire haze blankets North America cities",
    "Has Saudi Arabia bought men's professional golf?",
    "Pope Francis, 86, to have abdomen surgery",
    "Chris Christie's long-shot mission to torpedo Trump",
    "Pope Francis, 86, to have abdomen surgery",
    "Chris Christie's long-shot mission to torpedo Trump",
    "Seven shot at Virginia high school graduation",
    "Prince Harry arrives for day two cross-examination in hacking trial",
    "Sunak to raise trade issues in US talks with Biden",
    "Breaching the Kakhovka dam – who benefits?",
    "Ros Atkins unpacks the Ukraine dam breach",
    "'More water is coming every hour' - people flee as dam bursts",
    "Strikes heard during BBC interview about floods",
    "Beaver explores Kherson district after dam breach",
    "Inside the Taliban's drug war - opium poppy crops slashed",
    "‘My black skin says I don’t belong in Tunisia’",
    "Who is no longer world's richest? Our quickfire quiz...",
    "Warner thrives on Ashes 'pantomime villain' role",
    "Cat upstages royal historian mid-BBC interview",
    "Mass spelling contest held at Paris Champs-Élysées",
    "BBC editor tries out Apple's $3,499 headset",
    "Bleak future puts Afghan women in mental health crisis",
    "India cricketer who scripted dream win and got dropped",
    "Andrew Tate 'choked me until I passed out'",
    "The story of how the FBI caught a notorious spy",
    "Inside the Taliban's drug war - opium poppy crops slashed",
    "Girl from Ipanema singer Astrud Gilberto dies",
    "Detecting species from thin air",
    "Why AI won't be a burnout cure",
    "Where tipping is considered offensive?",
    "The best comic book movies ever made",
    "Why are there mountains inside Earth?",
    "Will a four-day week get workers back?",
    "Europe's under-the-radar gay hotspot"
]